###########################################################################
#
# Generated by : Version 9.0 Build 235 06/17/2009 Service Pack 2 SJ Web Edition
#
# Project      : nios_openMac
# Revision     : nios_openMac
#
# Date         : Fri Jan 22 23:00:52 W. Europe Standard Time 2010
#
###########################################################################


# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: ext_clk
create_clock -period "20.000 ns" \
             -name {ext_clk} {ext_clk}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------
derive_clock_uncertainty
# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------

# Represent unkown external clock as N/C (Not a Clock)
create_clock -name "N/C" -period 10.0
# --------------

set_max_delay -from [get_ports {data[*]}] -to [get_registers *] 2
set_max_delay -from [get_registers *] -to [get_ports {data[*]}] 5
set_max_delay -from [get_registers *] -to [get_ports {adr[*]}] 5
set_max_delay -from [get_registers *] -to [get_ports {nbe[*]}] 5
set_max_delay -from [get_registers *] -to [get_ports {sram_ncs}] 5
set_max_delay -from [get_registers *] -to [get_ports {noe}] 5
set_max_delay -from [get_registers *] -to [get_ports {nwe}] 5

#set_min_delay -from [get_ports {data[*]}] -to [get_registers *] 2
#set_min_delay -from [get_registers *] -to [get_ports {data[*]}] 1
#set_min_delay -from [get_registers *] -to [get_ports {adr[*]}] 1
#set_min_delay -from [get_registers *] -to [get_ports {nbe[*]}] 1
#set_min_delay -from [get_registers *] -to [get_ports {sram_ncs}] 1
#set_min_delay -from [get_registers *] -to [get_ports {noe}] 1
#set_min_delay -from [get_registers *] -to [get_ports {nwe}] 1


# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to phy0_rx_crsdv
set_max_delay 4 -from [get_ports {phy0_rx_crsdv}] -to [get_registers *]
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to *
set_max_delay 4 -from [get_ports *] -to [get_registers {phy0_rx_d[*]}]
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to phy1_rx_crsdv
set_max_delay 4 -from [get_ports {phy1_rx_crsdv}] -to [get_registers *]
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to *
set_max_delay 4 -from [get_ports *] -to [get_registers {phy1_rx_d[*]}]


# ** Tco/MinTco requirements
#    -----------------------
# --------------
# QSF: -name TCO_REQUIREMENT 8 ns -from * -to phy0_tx_en
set_output_delay 0.0 -clock "N/C" [get_ports {phy0_tx_en}]
set_max_delay 8 -from [get_keepers *] -to [get_ports {phy0_tx_en}]
# QSF: -name TCO_REQUIREMENT 8 ns -from * -to phy0_tx_d
set_output_delay 0.0 -clock "N/C" [get_ports {phy0_tx_d[*]}]
set_max_delay 8 -from [get_keepers *] -to [get_ports {phy0_tx_d[*]}]
# QSF: -name TCO_REQUIREMENT 8 ns -from * -to phy1_tx_en
set_output_delay 0.0 -clock "N/C" [get_ports {phy1_tx_en}]
set_max_delay 8 -from [get_keepers *] -to [get_ports {phy1_tx_en}]
# QSF: -name TCO_REQUIREMENT 8 ns -from * -to phy1_tx_d
set_output_delay 0.0 -clock "N/C" [get_ports {phy1_tx_d[*]}]
set_max_delay 8 -from [get_keepers *] -to [get_ports {phy1_tx_d[*]}]

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#
set_false_path -from [get_keepers {*dcfifo_60g1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_60g1*|*rs_dgwp|*dffpipe6|dffe7a[*]}]
set_false_path -from [get_keepers {*dcfifo_60g1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_60g1*|*ws_dgrp|*dffpipe10|dffe11a[*]}]
set_false_path -from [get_keepers {*dcfifo_vsf1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_vsf1*|*rs_dgwp|*dffpipe6|dffe7a[*]}]
set_false_path -from [get_keepers {*dcfifo_vsf1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_vsf1*|*ws_dgrp|*dffpipe9|dffe10a[*]}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[0]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[10]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[11]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[12]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[13]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[14]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[15]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[1]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[2]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[3]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[4]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[5]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[6]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[7]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[8]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|*}] -to [get_keepers {*niosII_openMac_clock_0*|slave_readdata[9]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[10]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[11]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[12]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[13]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[14]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[15]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[16]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[17]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[18]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[19]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[1]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[2]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[3]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[4]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[5]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[6]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[7]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[8]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_address_d1[9]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_byteenable_d1[0]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_byteenable_d1[1]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[0]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[10]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[11]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[12]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[13]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[14]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[15]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[1]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[2]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[3]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[4]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[5]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[6]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[7]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[8]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_0*|slave_writedata_d1[9]}] -to [get_keepers {*niosII_openMac_clock_0*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[0]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[10]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[11]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[12]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[13]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[14]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[15]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[1]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[2]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[3]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[4]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[5]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[6]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[7]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[8]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|*}] -to [get_keepers {*niosII_openMac_clock_1*|slave_readdata[9]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[10]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[11]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[12]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[13]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[14]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[15]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[16]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[17]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[18]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[19]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[1]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[20]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[21]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[22]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[2]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[3]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[4]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[5]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[6]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[7]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[8]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_address_d1[9]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[0]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[10]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[11]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[12]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[13]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[14]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[15]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[1]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[2]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[3]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[4]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[5]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[6]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[7]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[8]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_1*|slave_writedata_d1[9]}] -to [get_keepers {*niosII_openMac_clock_1*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[0]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[10]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[11]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[12]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[13]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[14]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[15]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[1]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[2]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[3]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[4]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[5]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[6]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[7]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[8]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|*}] -to [get_keepers {*niosII_openMac_clock_2*|slave_readdata[9]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_address_d1[1]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_address_d1[2]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_byteenable_d1[0]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_byteenable_d1[1]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[0]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[10]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[11]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[12]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[13]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[14]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[15]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[1]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[2]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[3]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[4]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[5]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[6]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[7]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[8]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_2*|slave_writedata_d1[9]}] -to [get_keepers {*niosII_openMac_clock_2*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[0]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[10]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[11]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[12]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[13]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[14]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[15]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[16]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[17]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[18]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[19]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[1]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[20]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[21]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[22]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[23]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[24]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[25]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[26]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[27]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[28]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[29]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[2]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[30]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[31]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[3]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[4]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[5]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[6]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[7]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[8]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|*}] -to [get_keepers {*niosII_openMac_clock_3*|slave_readdata[9]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_address_d1[2]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[0]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[10]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[11]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[12]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[13]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[14]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[15]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[16]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[17]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[18]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[19]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[1]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[20]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[21]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[22]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[23]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[24]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[25]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[26]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[27]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[28]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[29]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[2]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[30]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[31]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[3]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[4]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[5]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[6]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[7]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[8]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_3*|slave_writedata_d1[9]}] -to [get_keepers {*niosII_openMac_clock_3*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[0]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[10]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[11]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[12]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[13]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[14]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[15]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[1]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[2]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[3]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[4]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[5]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[6]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[7]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[8]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|*}] -to [get_keepers {*niosII_openMac_clock_4*|slave_readdata[9]}]

set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[10]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[11]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[1]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[2]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[3]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[4]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[5]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[6]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[7]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[8]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_address_d1[9]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_byteenable_d1[0]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_byteenable_d1[1]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[0]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[10]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[11]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[12]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[13]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[14]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[15]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[1]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[2]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[3]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[4]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[5]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[6]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[7]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[8]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]
set_false_path -from [get_keepers {*niosII_openMac_clock_4*|slave_writedata_d1[9]}] -to [get_keepers {*niosII_openMac_clock_4*|*}]


# ---------------------------------------------

# JTAG Signal Constraints constrain the TCK port (uncomment the line below if altera_reserved_tck isn't already defined)
#create_clock -name tck -period 100 [get_ports altera_reserved_tck]
# Cut all paths to and from tck
set_clock_groups -asynchronous -group [get_clocks altera_reserved_tck]
# Constrain the TDI port
set_input_delay -clock altera_reserved_tck -clock_fall 1 [get_ports altera_reserved_tdi]
# Constrain the TMS port
set_input_delay -clock altera_reserved_tck -clock_fall 1 [get_ports altera_reserved_tms]
# Constrain the TDO port
set_output_delay -clock altera_reserved_tck -clock_fall 1 [get_ports altera_reserved_tdo]

